INSERT INTO faculties (name, short_name) VALUES
('Системы управления, информатика и электроэнергетика', 'Институт №3'),
('Компьютерные науки', 'Институт №8');

INSERT INTO departments (faculty_id, name) VALUES
(1, 'Информатика и вычислительная техника'),
(1, 'Программная инженерия'),
(2, 'Фундаментальная информатика и информационные технологии'),
(2, 'Прикладная математика и информатика');

INSERT INTO teachers (department_id, last_name, first_name, middle_name, email, academic_position, hire_data) VALUES
(1, 'Иванов', 'Пётр', 'Сергеевич', 'ivanov@mai.ru', 'профессор', '2005-09-01'),
(1, 'Смирнова', 'Анна', 'Викторовна', 'smirnova@mai.ru', 'доцент', '2012-02-15'),
(2, 'Кузнецов', 'Дмитрий', 'Олегович', 'kuznetsov@mai.ru', 'старший преподаватель', '2016-09-01'),
(3, 'Орлова', 'Елена', 'Павловна', 'orlova@mai.ru', 'заведующий кафедрой', '2001-09-01'),
(4, 'Белов', 'Максим', 'Игоревич', 'belov@mai.ru', 'ассистент', '2022-09-01');

INSERT INTO study_groups (department_id, name, admission_year, study_form) VALUES
(1, 'М3О-311БВ-24', 2024, 'очная'),
(1, 'М3О-301БВ-24', 2024, 'очная'),
(2, 'М3О-412БВ-23', 2023, 'очная'),
(3, 'М8О-312БВ-24', 2024, 'очная'),
(3, 'М8О-411БВ-23', 2023, 'очная'),
(4, 'М8О-305БВ-24', 2024, 'заочная');

INSERT INTO students (group_id, last_name, first_name, middle_name, birth_date, email, record_book_no, enrollment_date, status) VALUES
(1, 'Алексеев', 'Игорь', 'Андреевич', '2006-03-12', 'alekseev@mai.ru', 'ПИ24-001', '2024-09-01', 'продолжает обучение'),
(1, 'Борисова', 'Мария', 'Сергеевна', '2006-07-25', 'borisova@mai.ru', 'ПИ24-002', '2024-09-01', 'продолжает обучение'),
(1, 'Волков', 'Артём', 'Денисович', '2006-01-30', 'volkov@mai.ru', 'ПИ24-003', '2024-09-01', 'продолжает обучение'),
(2, 'Григорьева', 'София', 'Игоревна', '2006-11-05', 'grigoreva@mai.ru', 'ПИ24-004', '2024-09-01', 'продолжает обучение'),
(2, 'Дмитриев', 'Кирилл', 'Павлович', '2005-12-19', 'dmitriev@mai.ru', 'ПИ24-005', '2024-09-01', 'продолжает обучение'),
(3, 'Егорова', 'Полина', 'Александровна', '2005-05-14', 'egorova@mai.ru', 'ПМ23-001', '2023-09-01', 'продолжает обучение'),
(3, 'Захаров', 'Никита', 'Романович', '2005-08-02', 'zaharov@mai.ru', 'ПМ23-002', '2023-09-01', 'академический отпуск'),
(4, 'Исаева', 'Дарья', 'Максимовна', '2006-02-21', 'isaeva@mai.ru', 'ФН24-001', '2024-09-01', 'продолжает обучение'),
(4, 'Козлов', 'Андрей', NULL, '2006-09-09', 'kozlov@mai.ru', 'ФН24-002', '2024-09-01', 'продолжает обучение'),
(2, 'Лебедева', 'Ксения', 'Олеговна', '2006-04-17', 'lebedeva@mai.ru', 'ПИ24-006', '2024-09-01', 'продолжает обучение');

INSERT INTO courses (department_id, name, lecture_hours, practice_hours) VALUES
(1, 'Базы данных', 32, 32),
(1, 'Алгоритмы и структуры данных', 32, 48),
(2, 'Линейная алгебра и аналитическая геометрия', 32, 16),
(2, 'Математический анализ', 48, 48),
(3, 'Философия', 24, 24),
(4, 'БЖД', 16, 16);

INSERT INTO course_offerings (course_id, group_id, teacher_id, academic_year, semester, control_type) VALUES
(1, 1, 1, 2025, 1, 'экзамен'),
(1, 2, 2, 2025, 1, 'экзамен'),
(2, 1, 2, 2025, 1, 'экзамен'),
(3, 3, 3, 2025, 1, 'экзамен'),
(4, 3, 3, 2025, 2, 'зачет с оценкой'),
(5, 4, 4, 2025, 1, 'экзамен'),
(6, 4, 5, 2025, 1, 'зачет'),
(2, 2, 1, 2025, 1, 'экзамен');

INSERT INTO grades (student_id, offering_id, attempt_no, grade, grade_date) VALUES
(1, 1, 1, 5, '2026-01-15'),
(2, 1, 1, 4, '2026-01-15'),
(3, 1, 1, 2, '2026-01-15'),
(3, 1, 2, 3, '2026-01-25'),
(1, 3, 1, 4, '2026-01-18'),
(2, 3, 1, 5, '2026-01-18'),
(3, 3, 1, 3, '2026-01-18'),
(4, 2, 1, 5, '2026-01-16'),
(5, 2, 1, 3, '2026-01-16'),
(10, 2, 1, 4, '2026-01-16'),
(4, 8, 1, 4, '2026-01-20'),
(5, 8, 1, 4, '2026-01-20'),
(6, 4, 1, 4, '2026-01-14'),
(7, 4, 1, 5, '2026-01-14'),
(8, 6, 1, 5, '2026-01-17'),
(9, 6, 1, 3, '2026-01-17');